aaron-bond.better-comments
akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
alefragnani.Bookmarks
amiralizadeh9480.cpp-helper
bungcip.better-toml
chouzz.vscode-better-align
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
connorshea.vscode-test-explorer-status-bar
cschlosser.doxdocgen
dakara.transformer
daohong-emilio.yash
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
DrMerfy.overtype
eamodio.gitlens
EditorConfig.EditorConfig
ericadamski.carbon-now-sh
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
fredwangwang.vscode-hcl-format
GitHub.codespaces
GitHub.copilot
GitHub.github-vscode-theme
GitHub.remotehub
github.vscode-github-actions
GitHub.vscode-pull-request-github
Gruntfuggly.todo-tree
hashicorp.hcl
hbenl.vscode-test-explorer
humao.rest-client
IBM.output-colorizer
idleberg.icon-fonts
jeff-hykin.better-cpp-syntax
jeff-hykin.better-shellscript-syntax
karyfoundation.comment
KevinRose.vsc-python-indent
leodevbro.blockman
llvm-vs-code-extensions.vscode-clangd
matepek.vscode-catch2-test-adapter
mechatroner.rainbow-csv
meganrogge.template-string-converter
mikestead.dotenv
mindaro-dev.file-downloader
ms-azuretools.vscode-docker
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-vscode.azure-repos
ms-vscode.cpptools
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.remote-explorer
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-repositories
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
mtxr.sqltools
mtxr.sqltools-driver-mysql
nickdemayo.vscode-json-editor
njpwerner.autodocstring
PeterSchmalfeldt.explorer-exclude
pranaygp.vscode-css-peek
quicktype.quicktype
redhat.vscode-xml
redhat.vscode-yaml
Remisa.shellman
rogalmic.bash-debug
rpinski.shebang-snippets
smcpeak.default-keys-windows
SonarSource.sonarlint-vscode
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
timonwong.shellcheck
tomoki1207.pdf
usernamehw.errorlens
vincaslt.highlight-matching-tag
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
VisualStudioExptTeam.vscodeintellicode-completions
vscode-icons-team.vscode-icons
WakaTime.vscode-wakatime
wayou.vscode-todo-highlight
xaver.clang-format
